In [1]:
import pandas as pd

In [26]:
df=pd.read_csv("C:/Users/vardh/Documents/Book.csv")

In [27]:
df

      City  weather outlook        date
0    Delhi     20.0    Cold  22-09-1998
1  Chennai     38.0     hot  22-09-9998
2      NaN      NaN     NaN         NaN
3   jaipur     18.0     NaN  22-09-1990
4   kadapa     34.0     hot  22-09-1978

In [28]:
newdf=df.dropna()

In [29]:
newdf

      City  weather outlook        date
0    Delhi     20.0    Cold  22-09-1998
1  Chennai     38.0     hot  22-09-9998
4   kadapa     34.0     hot  22-09-1978

In [30]:
newdf1=df.bfill()

In [31]:
newdf1

      City  weather outlook        date
0    Delhi     20.0    Cold  22-09-1998
1  Chennai     38.0     hot  22-09-9998
2   jaipur     18.0     hot  22-09-1990
3   jaipur     18.0     hot  22-09-1990
4   kadapa     34.0     hot  22-09-1978

In [32]:
newdf2=df.ffill()

In [33]:
newdf2

      City  weather outlook        date
0    Delhi     20.0    Cold  22-09-1998
1  Chennai     38.0     hot  22-09-9998
2  Chennai     38.0     hot  22-09-9998
3   jaipur     18.0     hot  22-09-1990
4   kadapa     34.0     hot  22-09-1978

In [34]:
aa=df.dropna(how="all")

In [35]:
aa

      City  weather outlook        date
0    Delhi     20.0    Cold  22-09-1998
1  Chennai     38.0     hot  22-09-9998
3   jaipur     18.0     NaN  22-09-1990
4   kadapa     34.0     hot  22-09-1978

In [36]:
df.pivot_table

<bound method DataFrame.pivot_table of       City  weather outlook        date
0    Delhi     20.0    Cold  22-09-1998
1  Chennai     38.0     hot  22-09-9998
2      NaN      NaN     NaN         NaN
3   jaipur     18.0     NaN  22-09-1990
4   kadapa     34.0     hot  22-09-1978>

In [40]:
df.pivot_table(index="City",columns="date")

           weather
date    22-09-1978 22-09-1990 22-09-1998 22-09-9998
City
Chennai        NaN        NaN        NaN       38.0
Delhi          NaN        NaN       20.0        NaN
jaipur         NaN       18.0        NaN        NaN
kadapa        34.0        NaN        NaN        NaN

In [41]:
newdf2.pivot_table(index="City",columns="date")

           weather
date    22-09-1978 22-09-1990 22-09-1998 22-09-9998
City
Chennai        NaN        NaN        NaN       38.0
Delhi          NaN        NaN       20.0        NaN
jaipur         NaN       18.0        NaN        NaN
kadapa        34.0        NaN        NaN        NaN